%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%
%&%                                                   %&%
%&%        Εργασία Δημητριάδη Σωκράτη Α.Μ.:359        %&%
%&%                                                   %&%
%&%    Τ.08 - ΘΕΜΑΤΑ ΨΗΦΙΑΚΗΣ ΕΠΕΞΕΡΓΑΣΙΑΣ ΕΙΚΟΝΑΣ    %&%
%&%          ΣΥΜΠΙΕΣΗ ΚΑΙ ΥΠΕΡΑΝΑΛΥΣΗ ΒΙΝΤΕΟ          %&%
%&%                                                   %&%
%&%           1Η ΠΡΟΓΡΑΜΜΑΤΙΣΤΙΚΗ ΑΣΚΗΣΗ              %&%
%&%                 Συνάρτηση ColOrd                  %&%
%&%                                                   %&%
%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%
%--------------------------------------------------------
function [g] = ColOrd(M)
% Η 'ColOrd' είναι μία συνάρτηση, που (παίρνει ως είσοδο
% τον διδιάστατο πίνακα που δημιουργείται από την εκτέλεση
% της συνάρτησης 'Turn2Dto1D',) επιλέγει τις στήλες 64x1 των
% υποπινάκων του και τις διατάσσει σε σειρά.
    [m,n]=size(M);
    t=0;
    l=0;
    for j=1:m
        t=t+1;
        for k=1:n
            g(t,k+32*l)=M(j,k);
        end
        if (mod(j,64)==0)
            t=0;
            l=l+1;
        end
    end
end

