%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%
%&%                                                   %&%
%&%        Εργασία Δημητριάδη Σωκράτη Α.Μ.:359        %&%
%&%                                                   %&%
%&%    Τ.08 - ΘΕΜΑΤΑ ΨΗΦΙΑΚΗΣ ΕΠΕΞΕΡΓΑΣΙΑΣ ΕΙΚΟΝΑΣ    %&%
%&%          ΣΥΜΠΙΕΣΗ ΚΑΙ ΥΠΕΡΑΝΑΛΥΣΗ ΒΙΝΤΕΟ          %&%
%&%                                                   %&%
%&%           1Η ΠΡΟΓΡΑΜΜΑΤΙΣΤΙΚΗ ΑΣΚΗΣΗ              %&%
%&%                 Συνάρτηση howmax                  %&%
%&%                                                   %&%
%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%
%--------------------------------------------------------
function [g] = howmax(M,q)
% Η 'howmax' είναι μία συνάρτηση, που παίρνει ως είσοδο
% έναν οποιοδήποτε πίνακα και βρίσκει τις q-κατά-απόλυτη-
% -τιμή-μεγαλύτερες τιμές του και μηδενίζει τις υπόλοιπες.

[m,n]=size(M);
count=0;
j=0;
k=0;
Z=abs(M);
while j<=m
    while k<=n
        [min_val,idx]=min(Z(:)); % Βρίσκει τη θέση του ελάχιστου στοιχείου
        [row,col]=ind2sub(size(M),idx); % και αντικαθιστά το στοιχείο
        Z(row,col)=Inf;                 % με +οο (+Infinity)
        count=count+1;
        if(count==(8*8-q))
            j=m;
            k=n;
        end
        k=k+1;
    end
    k=1;
    j=j+1;
end
for j=1:m
    for k=1:n
        if(Z(j,k)==Inf); % Βρίσκει τις τιμές που ήταν +οο
            M(j,k)=0;    % και τις μηδενίζει, όπως θέλουμε
    end
end
g=M;
end

