%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%
%&%                                                   %&%
%&%        Εργασία Δημητριάδη Σωκράτη Α.Μ.:359        %&%
%&%                                                   %&%
%&%    Τ.08 - ΘΕΜΑΤΑ ΨΗΦΙΑΚΗΣ ΕΠΕΞΕΡΓΑΣΙΑΣ ΕΙΚΟΝΑΣ    %&%
%&%          ΣΥΜΠΙΕΣΗ ΚΑΙ ΥΠΕΡΑΝΑΛΥΣΗ ΒΙΝΤΕΟ          %&%
%&%                                                   %&%
%&%           1Η ΠΡΟΓΡΑΜΜΑΤΙΣΤΙΚΗ ΑΣΚΗΣΗ              %&%
%&%                 ΜΕΡΟΣ 1.3                         %&%
%&%                                                   %&%
%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%
%--------------------------------------------------------
function [dctf2d2]=mydct2(f)
% Η "mydct2", είναι η αντίστοιχη συνάρτηση υπολογισμού του "Διακριτού
% Μετασχηματισμού Συνημιτόνου"(DCT), για κάποια διδιάστατη(2D) είσοδο 
% ακολουθίας f(x,y). Ο υπολογισμός του 2D-DCT γίνεται με χρήση της mydct, 
% που έχει υλοποιηθεί για μία διάσταση με την εξής μέθοδο: 
%
% 1)Εφαρμόζεται η συνάρτηση με είσοδο την κάθε γραμμή ξεχωριστά.
%
% 2)Αναστρέφουμε τον πίνακα mxn που προκύπτει, έτσι ώστε οι στήλες του, 
% να γίνουν γραμμές και οι γραμμές του, στήλες.
%
% 3)Επαναλαμβάνουμε το Βήμα 1 για τον νέο πίνακα, αφού πλέον οι στήλες
% θα είναι γραμμές.
%
% 4)Αναστρέφουμε πάλι τον προκύπτοντα πίνακα ώστε να λάβουμε το ζητούμενο.

[m,n]=size(f); % Αρχικοποίηση τιμών από τις διαστάσεις της ακολουθίας f(x)
dctf2d1=zeros(m,n); % Αρχικοποίηση πινάκων (Προτροπή της Matlab)
dctf2d2=zeros(m,n); % ...
    % Εδώ υλοποιείται το Βήμα 1 της μεθόδου:
    for k=1:m
        dctf2d1(k,:)=mydct(f(k,:)); % Υπολογισμός του dct για κάθε γραμμή
    end
    
% Εντολές για αποσφαλμάτωση και εποπτεία αποτελεσμάτων: 
% (Αποσχολιάστε για να εκτελεστούν)    
%   disp('1η Σάρωση ακολουθιών (Πριν την αναστροφή)');
%   disp(dctf2d1);
%% (Βήμα 2 της μεθόδου)
    dctf2d1=dctf2d1'; % Αναστροφή του πίνακα 
%%
% Εδώ υλοποιείται το Βήμα 3 της μεθόδου:
    for k=1:n
        dctf2d2(k,:)=mydct(dctf2d1(k,:)); % Υπολογισμός dct για "στήλες"
    end
%% (Βήμα 4 της μεθόδου)
    dctf2d2=dctf2d2'; % Τελική αναστροφή του πίνακα 
%%

% Εντολές για αποσφαλμάτωση και εποπτεία αποτελεσμάτων: 
% (Αποσχολιάστε για να εκτελεστούν) 
%   disp('και έτσι, ο 2D-DCT της f(x,y) μέσω του 2D-DFT της g(x,y), είναι:');
end

