%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%
%&%                                                   %&%
%&%        еЯЦАСъА дГЛГТЯИэДГ сЫЙЯэТГ а.л.:359        %&%
%&%                                                   %&%
%&%    т.08 - хелата ьгжиайгс епенеяцасиас еийомас    %&%
%&%          сулпиесг йаи упеяамакусг бимтео          %&%
%&%                                                   %&%
%&%           1г пяоцяаллатистийг асйгсг              %&%
%&%                 леяос 1.2                         %&%
%&%                                                   %&%
%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%
%--------------------------------------------------------


%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%
%&%                                                   %&%
%&%        еЯЦАСъА дГЛГТЯИэДГ сЫЙЯэТГ а.л.:359        %&%
%&%                                                   %&%
%&%    т.08 - хелата ьгжиайгс епенеяцасиас еийомас    %&%
%&%          сулпиесг йаи упеяамакусг бимтео          %&%
%&%                                                   %&%
%&%           1г пяоцяаллатистийг асйгсг              %&%
%&%                 леяос 1.3                         %&%
%&%                                                   %&%
%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%
%--------------------------------------------------------


%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%
%&%                                                   %&%
%&%        еЯЦАСъА дГЛГТЯИэДГ сЫЙЯэТГ а.л.:359        %&%
%&%                                                   %&%
%&%    т.08 - хелата ьгжиайгс епенеяцасиас еийомас    %&%
%&%          сулпиесг йаи упеяамакусг бимтео          %&%
%&%                                                   %&%
%&%           1г пяоцяаллатистийг асйгсг              %&%
%&%                 леяос 1.4                         %&%
%&%                                                   %&%
%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%
%--------------------------------------------------------

%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%
%&%                                                   %&%
%&%        еЯЦАСъА дГЛГТЯИэДГ сЫЙЯэТГ а.л.:359        %&%
%&%                                                   %&%
%&%    т.08 - хелата ьгжиайгс епенеяцасиас еийомас    %&%
%&%          сулпиесг йаи упеяамакусг бимтео          %&%
%&%                                                   %&%
%&%           1г пяоцяаллатистийг асйгсг              %&%
%&%                    леяос 2                        %&%
%&%                                                   %&%
%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%
%--------------------------------------------------------

%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%
%&%                                                   %&%
%&%        еЯЦАСъА дГЛГТЯИэДГ сЫЙЯэТГ а.л.:359        %&%
%&%                                                   %&%
%&%    т.08 - хелата ьгжиайгс епенеяцасиас еийомас    %&%
%&%          сулпиесг йаи упеяамакусг бимтео          %&%
%&%                                                   %&%
%&%           1г пяоцяаллатистийг асйгсг              %&%
%&%                 сУМэЯТГСГ howmax                  %&%
%&%                                                   %&%
%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%
%--------------------------------------------------------

%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%
%&%                                                   %&%
%&%        еЯЦАСъА дГЛГТЯИэДГ сЫЙЯэТГ а.л.:359        %&%
%&%                                                   %&%
%&%    т.08 - хелата ьгжиайгс епенеяцасиас еийомас    %&%
%&%          сулпиесг йаи упеяамакусг бимтео          %&%
%&%                                                   %&%
%&%           1г пяоцяаллатистийг асйгсг              %&%
%&%              сУМэЯТГСГ Turn2Dto1D                 %&%
%&%                                                   %&%
%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%
%--------------------------------------------------------

%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%
%&%                                                   %&%
%&%        еЯЦАСъА дГЛГТЯИэДГ сЫЙЯэТГ а.л.:359        %&%
%&%                                                   %&%
%&%    т.08 - хелата ьгжиайгс епенеяцасиас еийомас    %&%
%&%          сулпиесг йаи упеяамакусг бимтео          %&%
%&%                                                   %&%
%&%           1г пяоцяаллатистийг асйгсг              %&%
%&%              сУМэЯТГСГ Turn1Dto2D                 %&%
%&%                                                   %&%
%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%
%--------------------------------------------------------

%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%
%&%                                                   %&%
%&%        еЯЦАСъА дГЛГТЯИэДГ сЫЙЯэТГ а.л.:359        %&%
%&%                                                   %&%
%&%    т.08 - хелата ьгжиайгс епенеяцасиас еийомас    %&%
%&%          сулпиесг йаи упеяамакусг бимтео          %&%
%&%                                                   %&%
%&%           1г пяоцяаллатистийг асйгсг              %&%
%&%                 сУМэЯТГСГ ColOrd                  %&%
%&%                                                   %&%
%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%
%--------------------------------------------------------

%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%
%&%                                                   %&%
%&%        еЯЦАСъА дГЛГТЯИэДГ сЫЙЯэТГ а.л.:359        %&%
%&%                                                   %&%
%&%    т.08 - хелата ьгжиайгс епенеяцасиас еийомас    %&%
%&%          сулпиесг йаи упеяамакусг бимтео          %&%
%&%                                                   %&%
%&%           1г пяоцяаллатистийг асйгсг              %&%
%&%                     леяос 3                       %&%
%&%                                                   %&%
%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%
%--------------------------------------------------------
