%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%
%&%                                                   %&%
%&%        Εργασία Δημητριάδη Σωκράτη Α.Μ.:359        %&%
%&%                                                   %&%
%&%    Τ.08 - ΘΕΜΑΤΑ ΨΗΦΙΑΚΗΣ ΕΠΕΞΕΡΓΑΣΙΑΣ ΕΙΚΟΝΑΣ    %&%
%&%          ΣΥΜΠΙΕΣΗ ΚΑΙ ΥΠΕΡΑΝΑΛΥΣΗ ΒΙΝΤΕΟ          %&%
%&%                                                   %&%
%&%           1Η ΠΡΟΓΡΑΜΜΑΤΙΣΤΙΚΗ ΑΣΚΗΣΗ              %&%
%&%                 ΜΕΡΟΣ 1.4                         %&%
%&%                                                   %&%
%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%
%--------------------------------------------------------
% Παράδειγμα ενός 8x8 πίνακα για έλεγχο της mydct2
% f=[1 2 3 4 5 2 9 3; 3 4 6 3 8 9 3 1;
%     2 5 1 6 3 4 9 11; 2 4 8 3 12 3 7 9;
%     3 9 8 1 0 3 4 2; 2 8 9 10 2 9 3 4;
%     3 1 9 4 2 9 10 2; 2 8 2 1 9 3 6 7;]; 
% (Αποσχολιάστε τις παραπάνω γραμμές για να εκτελεστεί ο συγκεκριμένος)
%%
% Εναλλακτικά, για ποικίλα παραδείγματα και πειραματισμούς 
% μπορούμε να παράγουμε ψευδοτυχαία μία ακολουθία 
% f(x,y),x,y=1,2,...,8 με τις παρακάτω εντολές:
% 1) rand(8,8)*a , όπου a είναι ένας παράγοντας κλιμάκωσης 
% των τιμών της rand
% 2) και στρογγυλοποιόντας το αποτέλεσμα με την round(ans)
% 
f=round(rand(8,8)*10);
% 
% Διαφορετικά μπορούμε να μετατρέψουμε σε σχόλιο την παραπάνω εντολή
% και να αποσχολιάσουμε την αρχική τιμή της f στα σχόλια
% των γραμμών 14-17
f
ans1=round(mydct2(f),4) % Υπολογισμός του DCT μέσω της mydct2
ans2=round(dct2(f),4) % Υπολογισμός του DCT με τη συνάρτηση dct2(Matlab)

% Έλεγχος ισότητας των δύο αποτελεσμάτων 
if(ans1==ans2)
    disp('Τα δύο αποτελέσματα ταυτίζονται');
else
    disp('Τα δύο αποτελέσματα διαφέρουν');
end

