%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%
%&%                                                   %&%
%&%        Εργασία Δημητριάδη Σωκράτη Α.Μ.:359        %&%
%&%                                                   %&%
%&%    Τ.08 - ΘΕΜΑΤΑ ΨΗΦΙΑΚΗΣ ΕΠΕΞΕΡΓΑΣΙΑΣ ΕΙΚΟΝΑΣ    %&%
%&%          ΣΥΜΠΙΕΣΗ ΚΑΙ ΥΠΕΡΑΝΑΛΥΣΗ ΒΙΝΤΕΟ          %&%
%&%                                                   %&%
%&%           1Η ΠΡΟΓΡΑΜΜΑΤΙΣΤΙΚΗ ΑΣΚΗΣΗ              %&%
%&%              Συνάρτηση Turn2Dto1D                 %&%
%&%                                                   %&%
%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%
%--------------------------------------------------------
function [g] = Turn2Dto1D(M)
% Η 'Turn2Dto1D' είναι μία συνάρτηση, που παίρνει ως είσοδο
% έναν οποιοδήποτε διδιάστατο πίνακα και αντιστοιχεί τις
% τιμές του σε έναν μονοδιάστατο.
    [m,n]=size(M);
    t=0;
    for j=1:m
        for k=1:n
            t=t+1;
            g(j+t-1)=M(j,k);
        end
        t=t-1;
    end
    g=g';
end

