%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%
%&%                                                   %&%
%&%        Εργασία Δημητριάδη Σωκράτη Α.Μ.:359        %&%
%&%                                                   %&%
%&%    Τ.08 - ΘΕΜΑΤΑ ΨΗΦΙΑΚΗΣ ΕΠΕΞΕΡΓΑΣΙΑΣ ΕΙΚΟΝΑΣ    %&%
%&%          ΣΥΜΠΙΕΣΗ ΚΑΙ ΥΠΕΡΑΝΑΛΥΣΗ ΒΙΝΤΕΟ          %&%
%&%                                                   %&%
%&%           1Η ΠΡΟΓΡΑΜΜΑΤΙΣΤΙΚΗ ΑΣΚΗΣΗ              %&%
%&%                    ΜΕΡΟΣ 2                        %&%
%&%                                                   %&%
%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%&%
%--------------------------------------------------------
% Ο αλγόριθμος 'valcam', φορτώνει μία εικόνα της επιλογής
% μας από τη μνήμη και την επεξεργάζεται ανά μπλοκ των
% 8x8. Οι διαδικασίες που πραγματοποιούνται είναι η εφαρμογή
% του διδιάστατου DCT, η διατήρηση των 20 και 10
% κατά-απόλυτη-τιμή-μεγαλύτερων συντελεστών κάθε μπλοκ
% και ο αντίστροφός 2D-DCT αυτών.
%%
% Αναλυτικότερα, γίνονται τα εξής:

% Μέρος 2.1:
% ----------
% Φόρτωση της εικόνας, που θέλουμε να
% επεξεργαστούμε, από τη μνήμη
f=imread('cameraman.tif');
figure('Name','Cameraman');     % Εκτύπωση της αρχικής εικόνας
imshow(f);  % για οπτικούς λόγους και συγκρίσεις
%%
% Μέρος 2.2:
% ----------
% Λαμβάνοντας υπόψην την αναφορά στη επίσημη
% ιστοσελίδα της Matlab :

% http://www.mathworks.com/help/images/...
% ...ref/blockproc.html#output_argument_d119e6718

% και τον τρόπο χρήσης των εν λόγω εντολών,
% προσαρμόστηκε ο κώδικας στα δεδομένα
% της άσκησης ως εξής:
fun1 = @(block_struct) mydct2(block_struct.data);
% Η fun1 είναι η συνάρτηση που παίρνει ως όρισμα η blockproc, βάσει της
% αναφοράς που παραθέσαμε παραπάνω.Εδώ ορίζουμε ως συνάρτηση εφαρμογής,
% την mydct2.

% Στη συνέχεια εφαρμόζουμε τη συνάρτηση στην blockproc κατά μλοκ 8x8              
I2 = blockproc(f,[8 8],fun1); % Έτσι, η blockproc, όπως προσαρμόστηκε
                              % στο πρόβλημά μας, έχει αυτή τη μορφή.

figure('Name','mydct2');      % Εκτύπωση του αποτελέσματος
imshow(I2);                   % της I2 με τον DCT ανά μπλοκ
%%
% Μέρος 2.3:
% ----------
% Ομοίως κάνουμε με την συνάρτηση howmax(.,q) που κρατάει τους
% q-"σημαντικότερους" συντελεστές DCT (εδώ 20) και την εφαρμόζουμε
% πάλι κατά μπλοκ 8x8 ως εξής:
fun2 = @(block_struct) howmax(block_struct.data,20);
I3 = blockproc(I2,[8 8],fun2);

figure('Name','DCT 20');  % Εκτύπωση του αποτελέσματος
imshow(I3);               % της blockproc ως εικόνα με τους
                          % 20 κατά-απόλυτη-τιμή-μεγαλύτερους
                          % συντελεστές
%%
% Μέρος 2.4:
% ----------
% Παρόμοια, εφαρμόζουμε τον αντίστροφο 2D-DCT κατά
% μπλοκ 8x8, χρησιμοποιώντας τη συνάρτηση idct2, ως εξής:
fun3 = @(block_struct) idct2(block_struct.data);
I4 = blockproc(I3,[8 8],fun3);

figure('Name','IDCT 20');     % Εκτύπωση του αντίστοιχου αποτελέσματος
imshow(I4);                   % για τον IDCT, ως εικόνα πριν το
                              % μετατρέψουμε σε uint8 μορφή

I4=uint8(I4); % Μετατροπή σε uint8 μορφή
figure('Name','IDCT(UINT8) 20'); % Εκτύπωση του αντίστοιχου αποτελέσματος
imshow(I4);                    % για τον IDCT, ως εικόνα σε τύπο uint8

% Το PSNR του πειράματος με τους 20 είναι: 
psnr20DCT = psnr(I4,f)

%%
% Μέρος 2.5:
% ----------
% Επανάληψη του πειράματος:
% Κάνουμε το ίδιο κρατώντας τους 10
% σημαντικότερους συντελεστές DCT
% και έχουμε:
fun4 = @(block_struct) howmax(block_struct.data,10);
I5 = blockproc(I2,[8 8],fun4);

figure('Name','DCT 10');     % Εκτύπωση του αποτελέσματος
imshow(I5);                  % της blockproc ως εικόνα με τους
                             % 10 κατά-απόλυτη-τιμή-μεγαλύτερους
                             % συντελεστές
% Και αντίστοιχα, εφαρμόζουμε τον αντίστροφο 2D-DCT κατά
% μπλοκ 8x8, χρησιμοποιώντας τη συνάρτηση idct2, όπως πριν
I6 = blockproc(I5,[8 8],fun3);

figure('Name','IDCT 10');     % και εκτύπωση του αποτελέσματος
imshow(I6);                   % του IDCT ως εικόνα πριν το
                              % μετατρέψουμε σε uint8 μορφή

I6=uint8(I6); % Μετατροπή σε uint8 μορφή
figure('Name','IDCT(UINT8) 10'); % και εκτύπωση του αποτελέσματος
imshow(I6);                    % του IDCT ως εικόνα τύπου uint8

% Το PSNR του πειράματος με τους 10 είναι: 
psnr10DCT = psnr(I6,f)
